In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":['ashu','adi','arrush','ruhani','suhani'],
    "marks":[100,99,98,33,64],
    "city":['mohali','mohali','dehradun','solan','solan']
}

In [3]:
df=pd.DataFrame(dict1) #it would create a table frame of my dictnonary

In [4]:
df

     name  marks      city
0    ashu    100    mohali
1     adi     99    mohali
2  arrush     98  dehradun
3  ruhani     33     solan
4  suhani     64     solan

In [5]:
df.to_csv('siblings.csv') #to convert it to exel file

In [6]:
df.to_csv('siblings_no_index.csv',index=False) #to convert it to exel file with out index

In [7]:
df.head(2)#it would display first 2 elements of dictonanry

   name  marks    city
0  ashu    100  mohali
1   adi     99  mohali

In [8]:
df.tail(2)#it would display last 2 element of dictonanry

     name  marks   city
3  ruhani     33  solan
4  suhani     64  solan

In [9]:
df.describe() #it would give all statical analysis of the numerical column of the dictonary

            marks
count    5.000000
mean    78.800000
std     29.760712
min     33.000000
25%     64.000000
50%     98.000000
75%     99.000000
max    100.000000

In [10]:
singer=pd.read_csv('singer.csv') # to read a cvs file using pandas

In [11]:
singer

       SINGER  Albums  ratings
0  Babbu mann      12      5.0
1      Sharry       5      4.5
2       Garry       3      4.1
3       Sidhu       2      4.0
4       Honey       6      4.7